backend/controllers/ServerController.php

SELECT COUNT(*) FROM `account` WHERE (`is_deleted`=0) AND (`created_at` >= 1643662800) AND (`created_at` <= 1643749199)
SELECT COUNT(*) FROM `account` WHERE ((`is_deleted`=0) AND (`type`=1)) AND (`created_at` >= 1643662800) AND (`created_at` <= 1643749199)
SELECT COUNT(*) FROM `account` WHERE ((`is_deleted`=0) AND (`type`=2)) AND (`created_at` >= 1643662800) AND (`created_at` <= 1643749199)
---
    public function actionStats()
    {
        Yii::$app->response->format = Response::FORMAT_JSON;
        $period = Yii::$app->request->get('period');

        if (empty($period)) {
            return [
                'status' => ApiEnum::ERROR,
                'message' => 'Не передан параметр period',
            ];
        }

        $startPeriod = null;
        $endPeriod = null;

        switch ($period) {
            case 2:
                $startPeriod = time() - 3600;
                $endPeriod = time() + 3600;
                break;
            case 3:
                $startPeriod = strtotime('today 00:00:00');
                $endPeriod = strtotime('today 23:59:59');
                break;
            case 4:
                $startPeriod = strtotime('yesterday 00:00:00');
                $endPeriod = strtotime('yesterday 23:59:59');
                break;
        }

        $statAllAccount['all'] = Account::find()
            ->where([
                'is_deleted' => 0,
            ])
            ->andFilterWhere(['>=', 'created_at', $startPeriod])
            ->andFilterWhere(['<=', 'created_at', $endPeriod])
            ->count();

        $statAllAccount['withOutCapcha'] = Account::find()
            ->where([
                'is_deleted' => 0,
                'type' => Account::TYPE_WITHOUT_CAPCHA,
            ])
            ->andFilterWhere(['>=', 'created_at', $startPeriod])
            ->andFilterWhere(['<=', 'created_at', $endPeriod])
            ->count();

        $statAllAccount['withCapcha'] = Account::find()
            ->where([
                'is_deleted' => 0,
                'type' => Account::TYPE_WITH_CAPCHA,
            ])
            ->andFilterWhere(['>=', 'created_at', $startPeriod])
            ->andFilterWhere(['<=', 'created_at', $endPeriod])
            ->count();