backend/controllers/SettingsController.php

    public function actionIndex()
    {
        $configs = Config::find()->all();

        if (Yii::$app->request->isPost) {
            foreach (Yii::$app->request->post('Config') as $slug => $value) {
                $model = Config::findOne(['slug' => $slug]);
                $model->value = $value;

                if (!$model->save()) {
                    Yii::$app->session->addFlash(
                        'error',
                        'Настройка "' . $model->name . '" не сохранена. Ошибки: ' .
                        implode(' ', $model->getFirstErrors())
                    );

                    return $this->render('index', compact('configs',));
                }
            }

            Yii::$app->session->addFlash('success', 'Успешно сохранено.');
        }

        $configs = Config::find()->all();
---
SELECT * FROM `config`
SELECT * FROM `config` WHERE `slug`='token-bot'
UPDATE `config` SET `value`='2077049497:AAFQhwe99h6wNSFRgmGQZ6Knbq8zPUyXxog' WHERE `id`=1