backend/controllers/SiteController.php

    public function actionIndex()
    {
        $accountAllStats['allCount'] = Account::find()
            ->where([
                'is_deleted' => 0,
            ])->count();

        $accountAllStats['GoodCount'] = Account::find()
            ->where([
                'is_deleted' => 0,
                'type' => Account::TYPE_WITHOUT_CAPCHA,
            ])->count();

        $accountAllStats['GoodCapchaCount'] = Account::find()
            ->where([
                'is_deleted' => 0,
                'type' => Account::TYPE_WITH_CAPCHA,
            ])->count();

        $serverAllStats['allCount'] = Server::find()->count();
        $serverAllStats['GoodCount'] = Server::find()
            ->where(
                ['error' => null]
            )->count();
        $serverAllStats['ErrorCount'] = Server::find()
            ->where(
                ['not', ['error' => null]]
            )->count();

        $servers = Server::find()->all();
---
SELECT COUNT(*) FROM `account` WHERE `is_deleted`=0
SELECT COUNT(*) FROM `account` WHERE (`is_deleted`=0) AND (`type`=1)
SELECT COUNT(*) FROM `account` WHERE (`is_deleted`=0) AND (`type`=2)
SELECT COUNT(*) FROM `server`
SELECT COUNT(*) FROM `server` WHERE `error` IS NULL
SELECT COUNT(*) FROM `server` WHERE NOT (`error` IS NULL)
SELECT * FROM `server`