frontend/controllers/AccountController.php

INSERT INTO `account` (`data`, `type`, `server_id`, `created_at`) VALUES ('login:pass', 2, 5, 1643735424)
---
            'server_id' => $server->id,
        ]);

        if (!$account->save()) {