frontend/controllers/ServerController.php

    public function actionError()
    {
        Yii::$app->response->format = Response::FORMAT_JSON;

        $serverName = Yii::$app->request->get('server');
        $errorStr = Yii::$app->request->get('message');

        if (empty($serverName)) {
            return [
                'status' => ApiEnum::ERROR,
                'message' => 'Неверно указан server.',
            ];
        }

        $server = Server::findOne(['name' => $serverName]);

        if (empty($server)) {
            TelegramHelper::sendMessage([
                'chat_id' => Config::getValueBySlug('telegram-chat'),
                'text' => '‼️‼️‼️ Ошибка на сервере "' . $serverName . '". Внимание: этот сервер не найден в базе. Ошибка: ' . $errorStr,
            ]);
            return [
                'status' => ApiEnum::ERROR,
                'message' => 'Сервер не найден.',
            ];
        }

        $server->error = $errorStr;

        if (!$server->save()) {
---
SELECT * FROM `server` WHERE `name`='Тестовый сервер'
UPDATE `server` SET `error`='Описание ошибки' WHERE `id`=1