common/models/data/Account.php

SELECT COUNT(*) FROM `account` WHERE `is_deleted`=0
---
    public static function getCount()
    {
        return Account::find()
            ->where([
                'is_deleted' => 0,
            ])
            ->count();

SELECT COUNT(*) FROM `account` WHERE (`is_deleted`=0) AND (`type`=1)
---
    public static function getCountWithOutCapcha()
    {
        return Account::find()
            ->where([
                'is_deleted' => 0,
                'type' => Account::TYPE_WITHOUT_CAPCHA,
            ])
            ->count();

SELECT COUNT(*) FROM `account` WHERE (`is_deleted`=0) AND (`type`=2)
---
    public static function getCountWithCapcha()
    {
        return Account::find()
            ->where([
                'is_deleted' => 0,
                'type' => Account::TYPE_WITH_CAPCHA,
            ])
            ->count();