common/models/data/Config.php

SELECT `value` FROM `config` WHERE `slug`='telegram-chat' LIMIT 1
---
    public static function getValueBySlug($slug)
    {
        $configValue = static::find()
            ->select('value')
            ->where(['slug' => $slug])
            ->limit(1)
            ->scalar();