common/models/data/Server.php

SELECT EXISTS(SELECT * FROM `server` WHERE `server`.`name`='Тестовый сервер2')
SELECT * FROM `server` WHERE `name`='Тестовый сервер'
INSERT INTO `server` (`name`, `error`) VALUES ('Тестовый сервер4', NULL)
UPDATE `server` SET `error`=NULL WHERE `id`=1
---
    public static function createOrFindServer($name)
    {
        $server = Server::findOne(['name' => $name]);

        if ($server === null) {
            $server = new Server([
                'name' => $name,
            ]);
        }

        $server->error = null;


        if (!$server->save()) {

SELECT COUNT(*) FROM `account` WHERE (`server_id`=1) AND (`is_deleted`=0)
---
    public function getCountAccount()
    {
        return Account::find()
            ->where([
                'server_id' => $this->id,
                'is_deleted' => 0,
            ])
            ->count();

SELECT COUNT(*) FROM `account` WHERE (`server_id`=1) AND (`is_deleted`=0) AND (`type`=1)
---
    public function getCountWithOutCapchaAccount()
    {
        return Account::find()
            ->where([
                'server_id' => $this->id,
                'is_deleted' => 0,
                'type' => Account::TYPE_WITHOUT_CAPCHA,
            ])
            ->count();

SELECT COUNT(*) FROM `account` WHERE (`server_id`=1) AND (`is_deleted`=0) AND (`type`=2)
---
    public function getCountWithCapchaAccount()
    {
        return Account::find()
            ->where([
                'server_id' => $this->id,
                'is_deleted' => 0,
                'type' => Account::TYPE_WITH_CAPCHA,
            ])
            ->count();

SELECT * FROM `server`
SELECT COUNT(*) FROM `account` WHERE ((`server_id`=1) AND (`is_deleted`=0)) AND (`created_at` >= 1643662800) AND (`created_at` <= 1643749199)
---
    public static function getAllStat($startPeriod, $endPeriod)
    {
        $servers = self::find()->all();
        $result = [];

        /* @var Server $server */
        foreach ($servers as $server) {
            $query = Account::find()
                ->where([
                    'server_id' => $server->id,
                    'is_deleted' => 0,
                ])
                ->andFilterWhere(['>=', 'created_at', $startPeriod])
                ->andFilterWhere(['<=', 'created_at', $endPeriod]);